"The Unarchiver/Unarchive To Current Folder" = "The Unarchiver/إستخراج محتوى أرشيف إلى المجلد الحاوي له";

"The Unarchiver/Unarchive To Desktop" = "The Unarchiver/إستخراج محتوى أرشيف إلى سطح المكتب";

"The Unarchiver/Unarchive To..." = "The Unarchiver/إستخراج محتوى أرشيف إلى‫...‬";
